In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#create dataframe
dFrame = DataFrame(np.arange(12).reshape((3,4)),
                    index = ['NY','LA','SF'],
                    columns=['A','B','C','D'])

In [3]:
dFrame

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [4]:
#lower case index
dFrame.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [5]:
#assign to the actual index
dFrame.index = dFrame.index.map(str.lower)

In [6]:
dFrame

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [8]:
#rename to have transformed version
#str.title - capitalize
dFrame.rename(index=str.title, columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [9]:
#change columns or index
dFrame.rename(index={'ny':'New York'},
                columns={'A':'Alpha'})

          Alpha  B   C   D
New York      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [10]:
#make permenantent with inplace=True
dFrame.rename(index={'ny':'New York'}, inplace=True)

In [11]:
dFrame

          A  B   C   D
New York  0  1   2   3
la        4  5   6   7
sf        8  9  10  11